bench/crash-evidence-2026-08-28/conc-12.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xea2d94322520>, trust_remote_code=False, seed=42, num_prompts=72, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=16000, random_output_len=600, random_range_ratio='0.5', random_prefix_len=2128, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://vllm-nemotron.vllm.svc.cluster.local:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=12, model='nemotron-3.5-lightning', input_len=None, output_len=None, tokenizer='nvidia/NVIDIA-Nemotron-3.5-Lightning-30B-A3B-NVFP4', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='conc-12.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-a63d85f0-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-28 16:33:49 [utils.py:90] Sampling input_len from [8000, 24000] and output_len from [300, 900]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 12
100%|██████████| 72/72 [05:46<00:00,  4.81s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     72        
Failed requests:                         0         
Maximum request concurrency:             12        
Benchmark duration (s):                  346.05    
Total input tokens:                      1339377   
Total generated tokens:                  43328     
Request throughput (req/s):              0.21      
Output token throughput (tok/s):         125.21    
Peak output token throughput (tok/s):    287.00    
Peak concurrent requests:                14.00     
Total token throughput (tok/s):          3995.69   
---------------Time to First Token----------------
Mean TTFT (ms):                          5582.82   
Median TTFT (ms):                        3606.89   
P50 TTFT (ms):                           3606.89   
P90 TTFT (ms):                           13084.56  
P99 TTFT (ms):                           30120.99  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          84.76     
Median TPOT (ms):                        87.55     
P50 TPOT (ms):                           87.55     
P90 TPOT (ms):                           100.93    
P99 TPOT (ms):                           111.01    
---------------Inter-token Latency----------------
Mean ITL (ms):                           90.96     
Median ITL (ms):                         43.76     
P50 ITL (ms):                            43.76     
P90 ITL (ms):                            337.39    
P99 ITL (ms):                            451.38    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          56361.97  
Median E2EL (ms):                        58412.82  
P50 E2EL (ms):                           58412.82  
P90 E2EL (ms):                           73329.41  
P99 E2EL (ms):                           95542.71  
==================================================